In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [8]:
%sql SELECT * FROM songplays WHERE song_id IS NOT NULL LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(483, 1542837407796, 15, 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(80, 'Tegan', 'Levine', 'F', 'paid'),
 (97, 'Kate', 'Harrell', 'F', 'paid'),
 (97, 'Kate', 'Harrell', 'F', 'paid'),
 (80, 'Tegan', 'Levine', 'F', 'paid'),
 (97, 'Kate', 'Harrell', 'F', 'paid')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOPEGZN12AB0181B3D', 'Get Your Head Stuck On Your Neck', 'AREDL271187FB40F44', 0, Decimal('45.66159')),
 ('SOOJPRH12A8C141995', 'Loaded Like A Gun', 'ARBGXIG122988F409D', 0, Decimal('173.19138')),
 ('SOLEYHO12AB0188A85', 'Got My Mojo Workin', 'ARAGB2O1187FB3A161', 0, Decimal('338.23302')),
 ('SOBAYLL12A8C138AF9', 'Sono andati? Fingevo di dormire', 'ARDR4AC1187FB371A1', 0, Decimal('511.16363')),
 ('SOBKWDJ12A8C13B2F3', 'Wild Rose (Back 2 Basics Mix)', 'AR36F9J1187FB406F1', 0, Decimal('230.71302'))]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('AREDL271187FB40F44', 'Soul Mekanik', '', Decimal('NaN'), Decimal('NaN')),
 ('ARBGXIG122988F409D', 'Steel Rain', 'California - SF', Decimal('37.77916'), Decimal('-122.42005')),
 ('ARAGB2O1187FB3A161', 'Pucho & His Latin Soul Brothers', '', Decimal('NaN'), Decimal('NaN')),
 ('ARDR4AC1187FB371A1', 'Montserrat Caballé;Placido Domingo;Vicente Sardinero;Judith Blegen;Sherrill Milnes;Georg Solti', '', Decimal('NaN'), Decimal('NaN')),
 ('AR36F9J1187FB406F1', 'Bombay Rockers', 'Denmark', Decimal('56.27609'), Decimal('9.51695'))]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1542761878796, 0, 21, 47, 11, 2018, 2),
 (1542761921796, 0, 21, 47, 11, 2018, 2),
 (1542762125796, 1, 21, 47, 11, 2018, 2),
 (1542762193796, 1, 21, 47, 11, 2018, 2),
 (1542762329796, 1, 21, 47, 11, 2018, 2)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).